prototype_0_1/app/views/links/edit.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "links_tags" ON "tags"."id" = "links_tags"."tag_id" WHERE "links_tags"."link_id" = ?  [["link_id", 12]]
---
      <% tags = "" %>
        <% @link.tags.each do |tag| %>