prototype_0_1/app/views/links/show.html.erb

				<% tags = "" %>
				<% @link.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "links_tags" ON "tags"."id" = "links_tags"."tag_id" WHERE "links_tags"."link_id" = ?  [["link_id", 28]]