prototype_0_1/app/controllers/links_controller.rb

  def show
  	@link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]

  def create
	link = link_params
	tags = link.delete("tags").split(","); # TODO: fix this
    @link = Link.new(link)
  	tags.each do |tag|
  			if Tag.where(:tagName => tag.strip.gsub(' ', '-').downcase).size == 0
  				@tag = Tag.new
  				@tag.tagName = tag.strip.gsub(' ','-').downcase
  				@link.tags << @tag
---
SELECT "tags".* FROM "tags" WHERE "tags"."tagName" = 'lol' ORDER BY "tags"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "tags" WHERE "tags"."tagName" = 'lms'
INSERT INTO "links" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 31 Mar 2014 16:00:45 UTC +00:00], ["description", "asdfsd"], ["title", "asdf"], ["updated_at", Mon, 31 Mar 2014 16:00:45 UTC +00:00], ["url", "asdf"], ["user_id", 1]]
INSERT INTO "tags" ("created_at", "tagName", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 14 Apr 2014 03:36:52 UTC +00:00], ["tagName", "lms"], ["updated_at", Mon, 14 Apr 2014 03:36:52 UTC +00:00]]

  def edit
    @link = Link.find(params[:id])
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    link = link_params
    tags = link.delete("tags").split(","); # TODO: fix this
    @link = Link.find(params[:id])
    @link.tags.clear
    tags.each do |tag|
        if Tag.where(:tagName => tag.strip.gsub(' ', '-').downcase).size == 0
          @tag = Tag.new
          @tag.tagName = tag.strip.gsub(' ','-').downcase
          @link.tags << @tag
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "32"]]
SELECT "tags".* FROM "tags" INNER JOIN "links_tags" ON "tags"."id" = "links_tags"."tag_id" WHERE "links_tags"."link_id" = ?  [["link_id", 12]]
SELECT "tags".* FROM "tags" WHERE "tags"."tagName" = 'youtube' ORDER BY "tags"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "tags" WHERE "tags"."tagName" = 'hello'
INSERT INTO "links" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("created_at", "tagName", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 01 May 2014 10:57:47 UTC +00:00], ["tagName", "lol"], ["updated_at", Thu, 01 May 2014 10:57:47 UTC +00:00]]

  def destroy
    @link = Link.find(params[:id])
    @link.destroy
---
SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "32"]]
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 32]]