prototype_0_1/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "firstname", "lastname", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save