app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 18 Mar 2014 19:57:06 UTC +00:00], ["text", "sdfasdf"], ["title", "Hey"], ["updated_at", Tue, 18 Mar 2014 19:57:06 UTC +00:00]]
---
	def create
		@post = Post.new(params[:post])
		@post.save